WS_URL = 'ws://192.168.3.114:8123/api/websocket'  # Example: 'https://foobarhomeassistant.duckdns.org:8123/api/websocket'
URL = "http://192.168.3.114:8123/api"
TOKEN = "***************************************************************************************************************************************"

LIGHTS_MAP = {
    "书房": [r"^.*(电脑桌灯带|书房床头灯带|米家台灯|书房灯).*$"],
    "主卫": [r"^.*(主卫筒灯 \d|主卫浴霸).*$"],
    "次卫": [r"^.*(次卫筒灯 \d|次卫浴霸).*$"],
    "主卧": [r"^.*(主卧灯|主卧筒灯).*$"],
    "次卧": [r"^.*(次卧灯|晾衣架\d).*$"],
    "客厅": [r"^.*(门口射灯|走廊灯 \d|客厅灯|餐厅灯|射灯 \d|(阳台灯(带| \d))|晾衣架\d).*$"],
    "厨房": [r"^.*(厨房灯|厨房筒灯(左|右)).*$"],
}